chapter 3 revised
